{
  "sessions": [
    {
      "id": "498641",
      "title": "Why the Cloud Sucks - Reclaiming your smart home with self-hosted solutions",
      "description": "It’s been a long day. For hours it seems like there’s been nothing but work crises to deal with, but finally, you’re home. As you approach your driveway you tell your phone to open the garage door, ... but nothing happens. It’s happened again: the cloud service controlling your garage door is on the fritz. Now you have to try to find what you were hoping would become a quaint artifact of a bygone era, the garage door opener. Luckily, this isn’t your first rodeo, so you fish it out of its hidden place behind a nearby planter. The automation that normally recognizes you from presence detection software running on that same cloud service also fails, so you fish for your keys to the back door. It’s raining, and it’s cold. And now you’re not sure you remembered to bring your keys after all. You longingly think back to the promise of home automation, when you thought you wouldn’t have to fumble for keys, or garage door openers ever again. You reflect on your predicament, and wonder how it could have all gone so terribly wrong.\r\n\r\nIf you’ve ever dabbled in smart homes or home automation you’re probably been there. The truth is home automation these days is almost synonymous with the cloud. Wander down any home improvement store, or run any Google search, and the vast majority of smart home offerings are underpinned by varied, and often conflicting, cloud services and standards. Sure, “Works with Alexa” is helpful, and the ease of just plugging it in, setting up some credentials, and configuring automations is extremely seductive, but what happens if Alexa, or rather AWS, goes down in your area? Or more prosaically, what if your internet goes down?\r\n\r\nA better solution can be found in self-hosting your smart home. It takes more time, effort, and maintenance, but what you lose in instant gratification, you gain in knowing exactly what makes everything tick, and in the knowledge that if it goes down you know what to do. In this talk, I will present what building a self-hosted smart home entails, both the good and the bad. I will cover overall design decisions you will have to make and how to plan your process, including answering the all-important question, “how do I find smart home products that are cloud independent”?. I will also cover how to connect your devices to locally-running APIs, and how to bring it all together in one central panel. I will end by discussing three essential smart home items, and how to engineer them yourself in a way your whole family will feel confident using them. \r\n1. Garage door opener\r\n2. LED smart light\r\n3. Central, open-source, control center\r\n\r\nWhile this won’t be a coding session, code will be discussed, even shown. Join me as we discuss the true smart home of the future; the self-hosted smart home.\r\n",
      "startsAt": "2023-10-19T09:10:00",
      "endsAt": "2023-10-19T10:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a325da59-57f5-4b3a-a300-e266f5880b4e"
      ],
      "categoryItems": [
        167587,
        167592,
        167597,
        167600,
        167605
      ],
      "questionAnswers": [],
      "roomId": 35721,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "489354",
      "title": "A Great Big Useable Tomorrow: Disney's Approach to User Experience",
      "description": "Walt Disney. Dreamer. Animation Pioneer. Filmmaker. UX Designer. \r\n\r\nWhat can Disney parks can teach us about creating better experiences for users? We'll look at how Disney uses storytelling, theming, and immersive environments to create engaging experiences for visitors, and how these same principles can be applied to digital products.\r\n\r\nWe'll discuss how to create a seamless experience for users, from the moment they arrive on your website to the moment they leave, as well as using feedback and testing to continuously improve your user experience.\r\n\r\nWhether you're designing a website, app, or digital product, this talk will give you practical tips on how to create a user experience that captures your users' attention and keeps them engaged.",
      "startsAt": "2023-10-19T09:10:00",
      "endsAt": "2023-10-19T10:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "5706e39d-8684-41d1-8841-cf2f6c07e20f"
      ],
      "categoryItems": [
        167586,
        167597,
        167593
      ],
      "questionAnswers": [],
      "roomId": 35722,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "494891",
      "title": "Effective Automated Testing - Lessons from 10 Years",
      "description": "Writing automated tests is hard. Why? Changing data, inconsistent behaviors, unreliable environments, tightly coupled code, and more. In this session, we'll explore approaches for overcoming these challenges and writing robust and comprehensive automated tests. Topics explored will include mocking HTTP calls, creating effective test data, choosing between testing paradigms like unit, integration, and end-to-end tests, and custom dev tools. After this session, you'll walk away with new patterns and tools for comprehensively testing your app.  ",
      "startsAt": "2023-10-19T09:10:00",
      "endsAt": "2023-10-19T10:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "424f7166-a882-473f-b05e-15aed7f9ff86"
      ],
      "categoryItems": [
        167586,
        167599,
        167598
      ],
      "questionAnswers": [],
      "roomId": 38471,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "492693",
      "title": "The Care and Feeding of Bootcamp Graduates",
      "description": "So... you just hired a bootcamp graduate.  Now what?! \r\n\r\nThey're not your typical entry-level candidate.  They might need slightly more mentorship on the technical side, and slightly less on the business side.  Perhaps they're overwhelmed by the size of the company codebase, or perplexed by some of the new software and services they need to learn.  They may not know how to manage expense accounts, paid time off, retirement plans or health insurance--or even that those benefits are available.  \r\n\r\nBut... many of them have had jobs before.  They come with plenty of valuable experience from other fields.  They're motivated!  Teachable!  Destined for success... with your help.  In this session, we'll discuss some of the hurdles bootcamp grads face entering the field, and how to help them navigate their new normal.  We'll talk about inclusivity in recruiting, empathy in onboarding, and the unique mentorship needs of career changers.",
      "startsAt": "2023-10-19T09:10:00",
      "endsAt": "2023-10-19T10:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "3973e7f0-7d80-44cb-8831-b996f73f75f2"
      ],
      "categoryItems": [
        167586,
        167596,
        167605
      ],
      "questionAnswers": [],
      "roomId": 35723,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "497991",
      "title": "Cultivating a Developer-Centric Culture for Continuous Improvement",
      "description": "Discover the power of developer experience (DX) as a key differentiator in today's technology-driven landscape. In this session, we'll delve into the critical components of DX, practical strategies for improvement, and the impact it can have on organization's success. Gain actionable insights, real-world examples, and future trends to enhance developer experience and gain a competitive edge.\r\n\r\nKey Takeaways include:\r\nUnderstand the power of DX to boost productivity and competitiveness.\r\nFoster a developer-centric culture for collaboration and continuous improvement.\r\nMeasure and optimize DX through data-driven decision-making.\r\nImplement practical tips to improve documentation, workflows, tools, and communication for developers.\r\nGain insights from industry success stories leveraging DX for business benefits.\r\nStay ahead with future trends in DX for a competitive edge.",
      "startsAt": "2023-10-19T09:10:00",
      "endsAt": "2023-10-19T10:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "cd32c73d-00f3-434a-938a-9265bbe09e84"
      ],
      "categoryItems": [
        167587,
        167599
      ],
      "questionAnswers": [],
      "roomId": 38472,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "493837",
      "title": "This is a Promise That You'll Understand Asynchronous Programming with JavaScript",
      "description": "JavaScript is changing faster than ever with a yearly release cadence that brings useful syntax tweaks, new APIs, and updated language functionality. Of the dozens of new features added to JavaScript over the last ten years, Promises stand out as one of the most important yet most difficult to understand for both backend and frontend developers. If you're looking to finally understand the 'what', 'why', and 'how' of Promises, this is your ELI5 (\"explain like I'm five\") moment.\r\n\r\nLet's learn about asynchronous programming in JavaScript by understanding the fundamentals of Promises: why they were added to the language, what you need to write your own, how async/await fix Promise chaining, recent API changes, and much more. This session will introduce the basics of Promises, then ramp up into practical examples and techniques that will help you fully utilize Promises in your code today.",
      "startsAt": "2023-10-19T10:20:00",
      "endsAt": "2023-10-19T11:10:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b9c9b80c-b534-476f-b78c-17a89234bf8b"
      ],
      "categoryItems": [
        167586,
        167593,
        167599
      ],
      "questionAnswers": [],
      "roomId": 35721,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "486724",
      "title": "From Legacy Monolith to Microservices via Event Storming",
      "description": "It can be overwhelming to take a legacy monolith and split it into microservices, especially if the code seems messy. However, conversations with techies and non-techies over policies and process through an exercise called Event Storming can help ease your migration from a monolith to microservices. In this session, you will learn about Event Storming in the context of breaking down a legacy monolith eCommerce system into microservices.",
      "startsAt": "2023-10-19T10:20:00",
      "endsAt": "2023-10-19T11:10:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "9bde9de9-7bcb-4077-8087-47bf492a1344"
      ],
      "categoryItems": [
        167587,
        167599
      ],
      "questionAnswers": [],
      "roomId": 35722,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "486328",
      "title": "The Hidden Requirements: Exploring Emotions with Placebos",
      "description": "Traditionally, products and services are focused on various functional and non-functional requirements (things the product or service should be or do). While this is important, there has been a lack of focus on emotional requirements (feelings that the the product or service should induce in its users). Why is this important?\r\n\r\nBecause the way we feel is important and should be considered!\r\n\r\nA bold claim? Perhaps. And, as with any claim, it should be supported with evidence.  In this talk, I stress the importance of emotional requirements and support the claim by providing relevant facts, opinions, statistics, quotations, examples, hypotheticals, and more.  Once I’ve sufficiently supported the claim, I offer a few practical methods by which to gather, induce, and test emotional requirements. Finally, I use placebos as lens to view systems and gain insight into emotional requirements.\r\n\r\nJoin me for a thoughtful and thorough exploration of The Hidden Requirements!",
      "startsAt": "2023-10-19T10:20:00",
      "endsAt": "2023-10-19T11:10:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "70c37ef4-ef7f-48be-b2a6-790c716b6d29"
      ],
      "categoryItems": [
        167587,
        167597,
        167604,
        167599,
        167598
      ],
      "questionAnswers": [],
      "roomId": 38471,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "498011",
      "title": "The Hitchhiker's Guide to Cloud Architecture",
      "description": "Building a well-architected cloud application can be a daunting task, especially when it comes to navigating the various cloud providers and their seemingly endless array of services. But fear not, intrepid traveler! In this talk, we'll be your guide to the galaxy of cloud architecture, providing practical strategies for building secure and reliable cloud applications on AWS, Azure, and GCP.\r\n\r\nJust like the Hitchhiker's Guide to the Galaxy, I will break down the complex world of cloud computing into manageable pieces, examining the six pillars of a well-architected cloud application and the tools and resources offered by each cloud provider. We'll explore topics like operational excellence, security, reliability, cost optimization, performance efficiency, and migration, highlighting best practices and common pitfalls to avoid.\r\n\r\nBy the end of this talk, you'll be equipped with the knowledge and tools needed to navigate the vast expanse of cloud architecture and build a well-architected cloud application that can withstand any challenge the universe throws your way. So, grab your towel and join us on this journey through the cloud!\r\n",
      "startsAt": "2023-10-19T10:20:00",
      "endsAt": "2023-10-19T11:10:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "ea7dd1cc-19a7-49f4-87a9-333ad6cc0334"
      ],
      "categoryItems": [
        167587,
        167595
      ],
      "questionAnswers": [],
      "roomId": 35723,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "487894",
      "title": "AI for Highway Maintenance",
      "description": "Software touches every aspect of our lives, and no where is that clearer than in the automotive industry. With the recent surge to AI for self driving cars, we lose sight of adaptive cruise control, anti-lock breaks, and in-cab media centers that all require software to operate.\r\n\r\nHowever, did you realize that software plays a fundamental role in the streets you drive on? This talk is a post-mortem of a prototype system we built for optimizing the use of municipal funds for highway maintenance in the state of Indiana. While the optimizer is a central piece of the system, it wasn’t the whole system, or even the most challenging problem!\r\n\r\nIn this talk, we’ll cover:\r\n\r\n* The general problem of highway maintenance\r\n* How users acceptance and understanding may be a more important metric than pure cost optimization\r\n* How to build AI in an agile manner\r\n* How AI was merely a part of a much larger system\r\n* What changes when your software has to change hearts and minds as well as accomplish a technical task?\r\n",
      "startsAt": "2023-10-19T10:20:00",
      "endsAt": "2023-10-19T11:10:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "468d2621-a815-4e39-8c07-6c18162c9b1a"
      ],
      "categoryItems": [
        167586,
        167601
      ],
      "questionAnswers": [],
      "roomId": 38472,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "499014",
      "title": "Advancing your Technical Career Beyond Sr. Engineer",
      "description": "At times, it feels like everyone qualifies to be a Sr. Engineer.  After a year of experience, many companies can't really distinguish between engineering levels.   It can be difficult for engineers to understand how to grow in a technical career.  Years of experience are the only real factor.  In this talk, we present technical paths beyond a senior engineering level.  We present companies that promote different growth tracks along with engineers that distinguish themselves.  This will provide actionable opportunities along with ideas on how to identify when your current role won't grow and how to respond.",
      "startsAt": "2023-10-19T11:30:00",
      "endsAt": "2023-10-19T12:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "10fe89d2-3c89-4c02-b4da-cf84fda082b8"
      ],
      "categoryItems": [
        167587,
        167599,
        167596
      ],
      "questionAnswers": [],
      "roomId": 35721,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "499228",
      "title": "Database DevOps: Options for database change management",
      "description": "Whether you are the DBA for an Agile, Sprint-based team, or a developer with DBA responsibilities, you may feel like the development bottleneck at every turn. Managing migrations with your ORM of choice is easy but often error-prone and hard to manage as the project grows. Or worse yet, maybe your schema and change management is a folder full of poorly commented SQL scripts saved to a shared folder or local drive.\r\n\r\nSurely there's a better, SQL-centric way to manage databases as code, validate changes, and deploy updates - right? Yes, there is!\r\n\r\nThis talk will explore what database DevOps is and how open-source and paid tools like Flyway can help you manage database schema and code changes while incorporating agile CI/CD practices.\r\n\r\nBy the end of the session, you'll be ready to tame your rogue application databases, managing changes and migrations with ease, and become the envy of the development team.",
      "startsAt": "2023-10-19T11:30:00",
      "endsAt": "2023-10-19T12:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0785f402-af78-4d26-a024-a1fb32fefe04"
      ],
      "categoryItems": [
        167586,
        167594,
        167604
      ],
      "questionAnswers": [],
      "roomId": 35722,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "499146",
      "title": "Beyond Request/Response: Why and how we should change the way we build web applications",
      "description": "As web developers, we’ve been building web applications the same way for 25 years. We send a request, and we receive a response. We might get a whole page back, or we might get some data to render, but the common thread for almost every web application that has ever been built is the request/response cycle. What if we didn’t have to do it this way? What kind possibilities would open up to us?\r\n\r\nIn this session, we’ll take a simple, existing design pattern that you are probably already familiar with even if you don’t know it by name: the Event/State Reducer pattern. You’ve already used it if you’ve worked with Redux or Elm. We are going to stretch this pattern just a little: we will publish events from the client, use reducer functions on the server to compute our new state, and subscribe to these state changes on the client.\r\n\r\nWe’ll explore this idea with several code examples that gradually increase in complexity. We’ll see how building collaborative and real-time applications becomes natural and straightforward. We’ll also see how to combine statically generated websites with interactive applications in a way that was difficult or impossible before. You can expect to come away with practical but hopefully mind expanding new approaches to building your next application. \r\n",
      "startsAt": "2023-10-19T11:30:00",
      "endsAt": "2023-10-19T12:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "911aa52a-b0e0-42d7-99c2-e6701cfefcb0"
      ],
      "categoryItems": [
        167587,
        167593,
        167599
      ],
      "questionAnswers": [],
      "roomId": 38471,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "497235",
      "title": "Understanding a new codebase in 0-60 days",
      "description": "Eventually all developers end up here - the legacy codebase. Its one we didn't write ourselves and have no context on why decisions were made there but need to get up to speed with.\r\n\r\nThis talk will share the techniques I've used across multiple legacy codebases that have helped me get familiar with them as a new developer.\r\n\r\nWe'll talk about familiarizing yourself by using all available resources, including documentation, other developers, git history and yes, even confluence.\r\n\r\nWe'll round out the talk with suggestions on bringing about improvements to the legacy code after you've started understanding what's happening there. And finally, we tackle the ever-present issue that is technical debt in legacy codebases, and how to pay it off incrementally.",
      "startsAt": "2023-10-19T11:30:00",
      "endsAt": "2023-10-19T12:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "52999ef9-57f0-4e59-a4fb-cf8f7f865216"
      ],
      "categoryItems": [
        167586,
        167599,
        167596
      ],
      "questionAnswers": [],
      "roomId": 35723,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "497570",
      "title": "Microservices to Monolith: Lessons from NBA Topshot",
      "description": "When we set out to build NBA Topshot, we thought a microservices architecture was the right choice. But after 20 services and many headaches, we realized that sometimes the simplest approach is the best. We had over-engineered our code, slowed down our shipping speed, and created tech debt. When we started our next project, NFL All Day, we took a different approach and moved towards a near monolithic design. \r\n\r\nIn this talk, we'll share our journey on reducing complexity in microservices and provide a side-by-side comparison of the same feature implemented with both architectures. We'll discuss the pros and cons of each approach and how they impact simplicity, scalability, extensibility, and developer productivity, as well as share ways to improve your code from project to project.",
      "startsAt": "2023-10-19T11:30:00",
      "endsAt": "2023-10-19T12:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "6a15c59e-f611-47d6-9523-ca6999f281f0"
      ],
      "categoryItems": [
        167587,
        167592,
        167595,
        167594,
        167599
      ],
      "questionAnswers": [],
      "roomId": 38472,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "495705",
      "title": "The Labyrinth: Javascript Module Systems",
      "description": "The twisty history of the Javascript programming language has birthed not one, not two, but over half-a-dozen distinct module systems still in use today with lots of idiosyncrasies and subtle incompatibilities between them. This talk will cover how we got here, and what we can do about now it as poor web developers just trying to ship our apps.",
      "startsAt": "2023-10-19T12:40:00",
      "endsAt": "2023-10-19T13:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0623d5f0-582f-46cb-b963-e0d11bcd6161"
      ],
      "categoryItems": [
        167587,
        167593,
        167599
      ],
      "questionAnswers": [],
      "roomId": 35721,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "497256",
      "title": "How does Netflix build softwares to streamline organizational operations",
      "description": "Discover how Netflix transformed its workforce productivity through a robust suite of internal tools. Join us as we explore the innovative solutions that serve over 12,000 employees, measuring their impact, and driving continuous improvement.\r\n\r\nIn this session, we will dive into the key elements that drive our internal tool ecosystem. Learn how our custom-built feedback tools, 360-degree feedback platforms, and comprehensive internal employee directories have revolutionized the way our workforce operates. These purpose-built applications streamline workflows, enhance collaboration, and empower our employees to perform at their best.\r\n\r\nUncover the secrets behind our success as we unveil the data-driven approach used to measure the effectiveness of our tools. Gain insights into the metrics and analytics we employ to assess the impact on productivity, engagement, and operational efficiency. Discover how our continuous feedback cycles allow us to iterate and enhance our tools, ensuring they remain aligned with evolving employee needs.\r\n\r\nJoin us to explore real-world examples and success stories, as we demonstrate how Netflix's internal tools have become integral to our culture of innovation and high performance.\r\n\r\nLearn how Netflix is redefining the employee experience through innovation, measurement, and continuous improvement.",
      "startsAt": "2023-10-19T12:40:00",
      "endsAt": "2023-10-19T13:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "49b5ee60-1520-4c76-8840-632ac701d380"
      ],
      "categoryItems": [
        167586,
        167597,
        167593
      ],
      "questionAnswers": [],
      "roomId": 35722,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "486349",
      "title": "How I tricked my company into hiring Chat GPT",
      "description": "In a form of chaotic good, I had my company hire \"Chet Gupta\" aka Chat GPT.  A model software engineer with a fantastic resume and perfect answers, that doesn't exist.  In this this talk we will walk through the circumstances that allowed for this to happen.  The kinds of answers that \"Chet Gupta\" produced for both the technical screening process as well as the competency based interview.  We'll examine the ethical and practical considerations raised by the use of AI technology in the hiring process and the subsequent need for revised them. By the end of the session attendees will gain a deeper understanding of the implications of AI in building a talent workforce.",
      "startsAt": "2023-10-19T12:40:00",
      "endsAt": "2023-10-19T13:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8349af8b-173a-4670-a250-58284082fe4d"
      ],
      "categoryItems": [
        167587,
        167596
      ],
      "questionAnswers": [],
      "roomId": 38471,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "486748",
      "title": "What to Avoid When Writing Unit Tests",
      "description": "“These tests should never have been written. They provide no or little value.” -ME\r\n\r\nTesting code has been described as an \"art form.\" It is, but it should not be. There are many good patterns that should be followed when writing tests. There is even a lifecycle of tests that should be paid some attention. There are also many BAD patterns that developers should be aware of so that they can be avoided (or cleaned up).\r\n\r\nThis session will provide a series of examples of bad front-end tests and how to write them correctly.\r\n\r\n* Tests Should Not Be \"Well-Factored\"\r\n* Keep The Reader In The Test\r\n* Violate The DRY Principle\r\n* Testing Too Much\r\n* Duplication Of Code Logic\r\n* Bad Test Double\r\n* Testing The Mock\r\n* False Positives\r\n* Testing Private Functionality Directly\r\n* Excessive Setup",
      "startsAt": "2023-10-19T12:40:00",
      "endsAt": "2023-10-19T13:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "ed4af73a-6781-4882-a8c3-12ee0c68c1a5"
      ],
      "categoryItems": [
        167586,
        167593,
        167599,
        167598
      ],
      "questionAnswers": [],
      "roomId": 35723,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "497962",
      "title": "JSON Data Modeling in Document Databases",
      "description": "If you’re thinking about using a document database, it can be intimidating to start. A flexible data model gives you a lot of choices, but which way is the right way? Is a document database even the right tool? In this session we’ll go over the basics of data modeling using JSON. We’ll compare and contrast with traditional RDBMS modeling. Impact on application code will be discussed, as well as some tooling that could be helpful along the way. The examples use the Couchbase Capella document database, but the principles from this session can also be applied to CosmosDb, Mongo, RavenDb, etc.",
      "startsAt": "2023-10-19T12:40:00",
      "endsAt": "2023-10-19T13:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "51971bf5-3126-4aae-9825-76a0064c8c78"
      ],
      "categoryItems": [
        167586,
        167603,
        167594,
        167599
      ],
      "questionAnswers": [],
      "roomId": 38472,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "498910",
      "title": "Neurodiversity and Productivity – A Survival Guide",
      "description": "We live in a world where it’s easy to be overstimulated and distracted. The more virtual our world becomes, the harder it is to focus, communicate, and complete tasks. This is especially challenging for people with neurodiversities such as ADHD, Autism, and Dyslexia, and those that support them. The tech industry has a higher than average neurodiverse population, creating a unique set of time management and communication challenges. In this session, you’ll learn what it means to be neurodiverse and how it affects people at work. Based on scientific research and firsthand experience, we’ll discuss methods for maximizing productivity and focus. You’ll also learn how to communicate more effectively when everything feels overwhelming so you can get the support you need. While the focus is on neurodiversity, this session is designed for anyone who needs help navigating our increasingly distracting world. By the time you leave, you’ll have tools and techniques you can use to be more productive and less stressed - yes, that’s possible!",
      "startsAt": "2023-10-19T13:50:00",
      "endsAt": "2023-10-19T14:40:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "2ab36140-1f0d-46b1-85f5-c8f0222a4c4c"
      ],
      "categoryItems": [
        167586,
        167596
      ],
      "questionAnswers": [],
      "roomId": 35721,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "487890",
      "title": "Can We Learn to Manage Uncertainty? Probably!",
      "description": "When we’re asked when something will be done, it’s tempting to answer the question. “It’ll be done on March 32nd” or “it’ll take 182.5 days” or “we need 15 sprints”. It doesn’t matter if that answer is the best-case, average, or worst-case scenario.\r\n\r\nThe answer is fundamentally wrong because using a single value hides the fact that what we really meant was a distribution of possible dates, durations, or outcomes. The exact value is uncertain. Development may be faster or slower than we thought. What if the tech lead wins the lottery and retires? What if a global pandemic forces us to change the way we work?\r\n\r\nWhile we can’t control any of those factors, we can be mindful of their existence and communicate more clearly. In this talk we will introduce “bet” language, which makes uncertainty and luck an explicit part of the conversation. This mindset helps us accurately assess risks, pick the right risks to embrace, and avoid analysis paralysis. It also helps us learn in an uncertain world, where even if we make good decisions, we may experience bad outcomes (and vice versa!).",
      "startsAt": "2023-10-19T13:50:00",
      "endsAt": "2023-10-19T14:40:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "3963f1e7-00c7-47ba-9c88-9f1d9be28b43"
      ],
      "categoryItems": [
        167587,
        167599,
        167596
      ],
      "questionAnswers": [],
      "roomId": 35722,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "493960",
      "title": "AI and the Future of Testing",
      "description": "Chat GPT, Bard, Bing, CoPilot; the list goes on. The age of AI is officially here!  Artificial intelligence may sound scary to some but at isn't simplest form Artificial Intelligence just combines computer science and very large datasets, to help solve problems. In this talk, I will show you what AI may mean for the future of automated testing and whether or not it's coming for our jobs!",
      "startsAt": "2023-10-19T13:50:00",
      "endsAt": "2023-10-19T14:40:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f6dcea40-0fe0-4cd3-9be2-a2f20bd0201a"
      ],
      "categoryItems": [
        167586,
        167601,
        167598
      ],
      "questionAnswers": [],
      "roomId": 38471,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "499209",
      "title": "Building a Design system",
      "description": "Design systems have been generating a lot of hype lately and rightfully so! They can provide better user experiences, promote best practices, and help you develop products faster. But, before you open your favorite design tool or code editor to start throwing things together, there are some things you need to identify and document to prevent issues.",
      "startsAt": "2023-10-19T13:50:00",
      "endsAt": "2023-10-19T14:40:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b642eabd-7250-4ac5-b3b0-ce01951b88aa"
      ],
      "categoryItems": [
        167586,
        167597,
        167593,
        167599
      ],
      "questionAnswers": [],
      "roomId": 35723,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "496784",
      "title": "Account Protection: Balancing Security and Customer Friction",
      "description": "Securing online accounts is a very challenging problem. There has been a significant rise in fraud during the pandemic, leaving companies exposed to grave financial and legal risks. How do you know which sign-ins are bots or bad acting humans? If you clean up identities and drastically reduce the number of accounts that are reported to investors, what will that do to a company's valuation?\r\n\r\nThis presentation will show how the U.S. grocery giant Kroger implemented defense-in-depth best practices using multiple vendor-based and custom built solutions to protect more than 75 million accounts. You will get a peek at how we answered questions like: How do you stop credential stuffing attacks, ATOs, and coupon abuse? Is identity proofing valuable for grocery e-commerce accounts? Do we use a vendor for risk scoring or do we create in-house machine learning models? Where and when should we add targeted friction? How do we guide unsophisticated users to enroll in MFA?",
      "startsAt": "2023-10-19T13:50:00",
      "endsAt": "2023-10-19T14:40:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8cb1410d-99b1-456d-bcdc-3a5d8dc16c19"
      ],
      "categoryItems": [
        167587,
        167599,
        167602
      ],
      "questionAnswers": [],
      "roomId": 38472,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "487634",
      "title": "Accessibility Testing 101",
      "description": "Accessibility is important to ensuring that everyone has access to services and information needed to help them live as independent and fulfilling of lives as possible. However, sometimes ensuring things are accessible can be a bit of a daunting process to get started with when you initially start looking into it. This talk will delve into some concepts, methods, and tools that you can use to get started on your accessibility journey. \r\n\r\nWe'll look at features that may already be available to you in applications you use every day, as well as additional applications, extensions, and resources you can make use of. Life is rough enough, but with accessibility we can work together to make it better.",
      "startsAt": "2023-10-19T15:00:00",
      "endsAt": "2023-10-19T15:50:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a9f6a949-c457-482d-b321-b0c6849fecec"
      ],
      "categoryItems": [
        167586,
        167593,
        167598,
        167605
      ],
      "questionAnswers": [],
      "roomId": 35721,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "488388",
      "title": "Practical Auth(entication|orization) for Developers",
      "description": "It's never been easier to launch a website or expose services over HTTP. It's also never been easier to make rookie mistakes in the authentication of those services.\r\n\r\nThis session is designed for the average developer/architect that's struggling to make sense of modern authentication options. You'll learn the differences between OAuth, API Keys, HMAC, JSON Web Tokens (JWT), SAML, and more. \r\n\r\nDon't worry if those things sound foreign; they'll be explained in a clear, practical way so that you can choose the appropriate tool for your needs without making rookie mistakes.",
      "startsAt": "2023-10-19T15:00:00",
      "endsAt": "2023-10-19T15:50:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b7235790-4c4a-491c-a8a1-1ed82a5d70b3"
      ],
      "categoryItems": [
        167586,
        167602
      ],
      "questionAnswers": [],
      "roomId": 35722,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "488402",
      "title": "Competence is Overrated",
      "description": "Or, How to Succeed at Your Job When You Don’t Know What You’re Doing. It can be hard to stay positive and motivated at work when you don’t know what you’re doing. Let me, a software developer with a Studio Art degree, teach you my secrets on how to succeed at your job even when you lack the skills and experience in that “Required” list on the job description.  ",
      "startsAt": "2023-10-19T15:00:00",
      "endsAt": "2023-10-19T15:50:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "645adf23-f177-4ca8-b3c5-f2217624f488"
      ],
      "categoryItems": [
        167586,
        167596
      ],
      "questionAnswers": [],
      "roomId": 38471,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "489156",
      "title": "Visualizing Code",
      "description": "What happens if we combine the fields of software architecture and data visualization? In this talk, we'll explore what the code and work item management systems we work with every day can tell us about the evolving nature of software and how we communicate it.\r\n\r\nThis talk will highlight a variety of ways to visualize codebases ranging from highly experimental perspectives to more practical and polished ways of looking at codebases.\r\n\r\nWe'll follow a data analysis workflow of seeing what data we can pull out of our systems and exploring what insights that data can tell us. We'll talk a bit more about some of the specific concerns you might have in data cleaning that relate specifically to code, source control, and work item management systems. We'll also include a discussion on how to share insights from code and specific concerns you may need to watch out for when doing so.\r\n\r\nWhile the main point of this talk is to get you thinking differently about your code and how you communicate it, we'll close with a discussion of some tools out there that provide code visualization features.",
      "startsAt": "2023-10-19T15:00:00",
      "endsAt": "2023-10-19T15:50:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "17c299ee-d9fd-4020-b499-2837b2b3a2bf"
      ],
      "categoryItems": [
        167587,
        167595,
        167603,
        167605
      ],
      "questionAnswers": [],
      "roomId": 35723,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "497118",
      "title": "Building Continuously Available and Highly Performant Critical Systems",
      "description": "Have you ever wondered what it takes to build a highly resilient distributed caching platform for critical real-time payment systems? Join us as we share our journey of building a highly available and fault-tolerant caching solution while leveraging automation to achieve a faster MTTR.\r\n\r\nPayment systems that support real-time transaction processing are expected to be available and highly responsive 24/7/365. These systems must be fault-tolerant and highly resilient to any failures that might happen during payment transaction processing.\r\nBuilding a low-latency payment system that spans multiple geographic locations requires a distributed caching solution for low latency and high-throughput data access. While building a real-time transaction processing system at Discover - one that is continuously available and can process thousands of transactions per second with a sub-second response time - we decided to introduce distributed caching technology into our architecture to minimize the latency and to replicate the data across multiple data centers. This presented numerous challenges:\r\n•\tHow to run Active-Active cache clusters in multiple deployment regions with high-availability\r\n•\tHow to auto-heal cache cluster failures due to network partitioning or disaster\r\n•\tHow to automatically failover client applications in response to failures\r\n•\tHow to automatically recover failed clusters to reduce MTTR\r\n•\tHow to ensure data consistency after the cluster is recovered\r\n•\tHow to implement a real-time monitoring and alerting solution for client and cluster connectivity\r\n\r\nIn this talk, we will take you through our journey of how we built a distributed caching solution to solve the challenges we faced.\r\n•\tConfiguration-driven and thread-safe smart client solution that can intelligently detect failures\r\n•\tAbility for the client application to failover if the error rate is above a certain threshold\r\n•\tAutomation to recover failed cluster and failback client connections after the cluster is recovered\r\n•\tWorkflow automation for data consistency after the cluster is recovered\r\n•\tReal-time streaming of client connectivity metrics\r\n•\tObservability solution to simplify operational support\r\n",
      "startsAt": "2023-10-19T15:00:00",
      "endsAt": "2023-10-19T15:50:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "76e9f1bd-6816-419d-976f-8bed355214a6",
        "4f132e2a-6b94-48bb-9a61-c270dff86b6a"
      ],
      "categoryItems": [
        167587,
        167592,
        167604,
        167599,
        167605
      ],
      "questionAnswers": [],
      "roomId": 38472,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "487520",
      "title": "Who Goes There? Actively Detecting Intruders With Cyber Deception Tools",
      "description": "Intrusion detection works best when you can discover the attacker while they are still in the system. Finding out after the fact does little to protect your systems and your data. \r\n\r\nIdeally, you would want to set an alarm that an attacker would trigger while limiting the damage to your environment.\r\n\r\nWe know from many recent breaches that attackers commonly try to expand their foothold in a system by finding and exploiting hardcoded credentials in environments they have accessed.  We can use these behavioral patterns to our advantage by engaging in defensive cyber deception.   \r\n\r\nYou might already be familiar with the concept of honeypots, false systems, or networks meant to lure and ensnare hackers. There is a subclass of honeypots that require almost none of the overhead, are simple to deploy, are used by many industries, and lure attackers to trigger alerts while they are trying to gain further access. The industry has arrived at the term honeytoken for this branch of cybersecurity tooling. \r\n\r\nTakeaways:\r\n- Analysis of recent breaches for common attack behaviors\r\n- A history of cyber deception and the evolution of honeypots in defensive strategies. \r\n- Understanding how honeytokens work\r\n- Maximizing the impact of honeytokens\r\n",
      "startsAt": "2023-10-19T16:10:00",
      "endsAt": "2023-10-19T17:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "053bf183-629a-4dd5-b66e-e2b1d7142a49"
      ],
      "categoryItems": [
        167586,
        167604,
        167602
      ],
      "questionAnswers": [],
      "roomId": 35721,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "497485",
      "title": "Unleashing ML Potential: Essential Design Patterns and MLOps Strategies for Business Solutions",
      "description": "Machine Learning is on another hype cycle with generative interfaces such as ChatGPT and MidJourney pushing the edge on NLP and Image generation challenges. However, there’s more to deploying ML systems than the modeling technique or the UX. What ML design systems considerations do you need to tackle classical problems in the domain of search, recommendation systems or ads prediction? How do you confidently deploy your models to production?\r\n\r\nAs an ML Engineer you need to be able to build distributed systems that address scalability, observability and other NFRs. You need solid MLOps techniques to deliver true value to your users.\r\n\r\nThis talk dives into five critical ML system design patterns, illuminating methodical approaches to traditional ML business problems. You'll acquire a solid understanding of essential MLOps practices necessary for scaling your models and responding to production challenges.\r\n\r\nJoin us as we unravel the intricacies of ML system design and MLOps, empowering you to implement scalable and adaptive ML solutions in production. This isn't just a technical walkthrough - it's a roadmap to enhancing business problem-solving and user value delivery using Machine Learning.",
      "startsAt": "2023-10-19T16:10:00",
      "endsAt": "2023-10-19T17:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "d6efef12-0cc5-4fe1-b506-20bee22d0fff"
      ],
      "categoryItems": [
        167587,
        167601,
        167603,
        167599
      ],
      "questionAnswers": [],
      "roomId": 35722,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "489725",
      "title": "DevOps in the Cloud: Case Studies of Amazon.com teams and their resilient architectures",
      "description": "Join Seth, an experienced Amazon technologist with over 12 years of experience working on the company's highly scalable systems, as he takes you on a journey through the unique DevOps culture at the online retailer Amazon.com. Discover the secrets behind the company's successful customer experience, and learn how \"two-pizza teams\" foster accountability and ownership in the systems they create and run in the cloud. Seth has worked with multiple of these teams, helping them incorporate best practices for building resilient workloads, and will share their technology and processes for running services in the cloud with you. Dive into real-world examples of Amazon's systems, such as how the search team uses chaos engineering to be ready for Prime Day, any day, and how transportation uses resilience best practices to keep the trucks rolling, Gain insights into the resilience strategies that Amazon employs, including chaos engineering, automated deployment, and multi-site architectures. Leave with practical, actionable techniques and approaches that you can apply to your own strategy for building resilient systems that can handle any challenge.",
      "startsAt": "2023-10-19T16:10:00",
      "endsAt": "2023-10-19T17:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "6d5add80-9200-4afc-9f33-3cd18e26d723"
      ],
      "categoryItems": [
        167587,
        167595,
        167604,
        167599,
        167598
      ],
      "questionAnswers": [],
      "roomId": 38471,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "493694",
      "title": "Just the fun stuff: embracing low code as a hardcore developer",
      "description": "Developers do what they do best because they love problem solving. Nothing is more satisfying than seeing those lines of code we've written run smoothly and seamlessly to solve the issue at hand.\r\n\r\nUnfortunately there's a bunch of housekeeping that usually has to come before we get to make those little bits of mastery execute. Decisions need to be made, scaffolding needs to be put in place, our code needs a foundation before we're able to realize those little joys we crave.\r\n\r\nBut what if we didn't have to worry about that? We've all heard of no code and low code platforms, but aren't they just taking our fun from us? Trying to replace us with the robots? Let's talk about what these platforms are, what makes a good platform for developers and how a solid low code platform let's us get from 0 to fun in the least time possible.",
      "startsAt": "2023-10-19T16:10:00",
      "endsAt": "2023-10-19T17:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "21cf0bf8-44ec-4b3d-b3e0-005a7a59420b"
      ],
      "categoryItems": [
        167586,
        167593,
        167599,
        167605
      ],
      "questionAnswers": [],
      "roomId": 35723,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    },
    {
      "id": "496798",
      "title": "The Power of 'No'",
      "description": "Have you ever attended a meeting that you wish you hadn’t? Have you ever been happy that plans were canceled because you never really wanted to go in the first place? \r\n\r\nSaying no is hard and can be truly challenging when faced with the prospect of feeling like maybe you’ll let someone down. Another reason saying no is hard is the feeling or FOMO, or the Fear Of Missing Out. But are those reason really worth our peace of mind?\r\n\r\nThis talk is about how knowing when to say no and how to do so. ",
      "startsAt": "2023-10-19T16:10:00",
      "endsAt": "2023-10-19T17:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "aae8e930-83f8-45be-b1a9-d47075235565"
      ],
      "categoryItems": [
        167587,
        167596
      ],
      "questionAnswers": [],
      "roomId": 38472,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted"
    }
  ],
  "speakers": [
    {
      "id": "76e9f1bd-6816-419d-976f-8bed355214a6",
      "firstName": "Aman",
      "lastName": "Sardana",
      "bio": "I am a technology professional working in the financial services and payments domain. I’m a hands-on technology leader, enabling business capabilities by implementing cutting-edge, modernized technology solutions. I am skilled in designing, developing, and implementing innovative financial technology solutions that drive business results and establish best-in-class operations.\r\n\r\nI did my Masters in Information Technology from Northwestern University which is a unique program that straddles the business and technical side of information technology focusing on data mining, information security, enterprise architecture, statistics, innovation, marketing and finance to name a few.",
      "tagLine": "Discover Financial Services, Senior Principal Application Architect",
      "profilePicture": "https://sessionize.com/image/729e-400o400o2-H1EeVbDifh42uCRX9wVpNi.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/amansardana22/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://asardana.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.discover.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        497118
      ],
      "fullName": "Aman Sardana",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "645adf23-f177-4ca8-b3c5-f2217624f488",
      "firstName": "Amy",
      "lastName": "Norris",
      "bio": "Amy is a graphic designer turned software developer currently building weird, cool, and unconventional stuff at Dimensional Innovations. On her off time she can be found volunteering with Kansas City Women in Tech, reading or playing Dungeons and Dragons.\r\n",
      "tagLine": "Full stack software developer, Dimensional Innovations",
      "profilePicture": "https://sessionize.com/image/0119-400o400o2-aa1Hhpae8zGSnYJpZurTBd.jpeg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/norrisamy/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://www.dimin.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        488402
      ],
      "fullName": "Amy Norris",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a325da59-57f5-4b3a-a300-e266f5880b4e",
      "firstName": "Arturo",
      "lastName": "Araya",
      "bio": "Arturo has had dual, sometimes competing, sometimes collaborating, passions in both music and technology since he was 10. After pursuing, and receiving, a Bachelors, Masters, and  finally an Artist Diploma in Cello Performance from  Oberlin Conservatory and the University of Cincinnati's College-Conservatory of Music, and after then briefly performing as principal cellist of the Shenzhen Symphony Orchestra in Shenzhen, PRC, Arturo's career took him in a completely different direction. \r\n\r\nCurrently, Arturo is tech lead for Fifth Third Bank in the areas of Software Security and Risk Mitigation, where he gets to cooperate with great people, solving interesting puzzles that  make the online banking experience safer for all of Fifth Third's customers. While he still pursues music, off the clock Arturo works on crafting his own smart home system, building components from scratch, and working out how to get them to talk to one another. He spends equal amounts of time tending to his home lab, a sort of \"digital garden\".",
      "tagLine": "Arturo Araya, Lead Software Engineer, Fifth Third Bank",
      "profilePicture": "https://sessionize.com/image/7e4d-400o400o2-BXBr9SEka9L4FXvGFF74gb.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/arturoarayacincinnati/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        498641
      ],
      "fullName": "Arturo Araya",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "4f132e2a-6b94-48bb-9a61-c270dff86b6a",
      "firstName": "Bhargav Krishna",
      "lastName": "Nachegari",
      "bio": "As a Full Stack Engineer with over nine years of experience, I have honed my skills in designing solutions, architecting high-availability payment platforms, and leading teams to build resilient systems and APIs. My foundation in data structures, algorithms, and core programming principles forms the backbone of my technical expertise, enabling me to adapt and thrive in various programming languages and frameworks\r\n\r\nI am excited on sharing my insights and experiences in building continuously available critical systems. I have served in key advisory roles for senior leadership on Enterprise System Management, contributed to the design and architecture of high-availability, resilient, and distributed systems, and overseen projects to ensure the timely delivery of key objectives. My strong technical background, exceptional analytical ability, effective communication skills, and team-oriented mindset equip me to make a valuable contribution to the discourse on critical system availability.",
      "tagLine": "Discover, Principal Application Engineer",
      "profilePicture": "https://sessionize.com/image/bb3d-400o400o2-KuutMDUs2PZA7tmkKLUn6a.jpeg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/bhargav-nachegari-422a1233/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://www.discover.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        497118
      ],
      "fullName": "Bhargav Krishna Nachegari",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "ed4af73a-6781-4882-a8c3-12ee0c68c1a5",
      "firstName": "Bob",
      "lastName": "Fornal",
      "bio": "My focus is on front-end development: JavaScript, CSS, SVG, AngularJS and Angular, React, and Ionic. I commonly speak about Quality Engineering, Best Practices, and Front-End Technologies.\r\n\r\n\"Learning from my mistakes over the decades, I feel that I have become a solid programmer.\" -- Me",
      "tagLine": "Senior Solutions Developer (Front-End) at Leading EDJE with a passion for learning, testing, mentoring, speaking and personal growth. Blessed husband and proud father of two",
      "profilePicture": "https://sessionize.com/image/72b3-400o400o2-wkngtwMKUcVNxcmS2rBGgG.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/rfornal",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/rfornal/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://dev.to/rfornal",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.leadingedje.com/home",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        486748
      ],
      "fullName": "Bob Fornal",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b9c9b80c-b534-476f-b78c-17a89234bf8b",
      "firstName": "Brandon",
      "lastName": "Bruno",
      "bio": "Brandon has been hacking away at code since a dusty Commodore 64 appeared from his parents' attic in the early 90's, but has spent the last 15 years building client solutions in .NET, JavaScript, and Sitecore DXP. He is currently a Solution Engineer at Sitecore, Inc. and is active in the Sitecore community as a former Sitecore MVP (2018 - 2021). He focuses on solution architecture, content management, application security, and dodging Atlanta traffic.",
      "tagLine": "Solution Engineer at Sitecore, Inc.",
      "profilePicture": "https://sessionize.com/image/0e14-400o400o2-sjNLcvrthjycbTw5nLQRk7.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/BrandonMBruno",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/brandonbruno/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.sitecorespark.com",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        493837
      ],
      "fullName": "Brandon Bruno",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b642eabd-7250-4ac5-b3b0-ce01951b88aa",
      "firstName": "Burton",
      "lastName": "Smith",
      "bio": "I am a technical lead at Microsoft working with design systems and web components.\r\n\r\nI am also the creator of various open-source projects like Kickstand UI (a design system built with web components - kickstand-ui.com) and Clarion (a style framework for managing design systems - projectclarion.com).\r\n\r\nIn my free time, I love spending time with my wife and three daughters, practicing martial arts, jamming on my ukulele, and learning new things (usually about software engineering).",
      "tagLine": "Technical Lead at Microsoft",
      "profilePicture": "https://sessionize.com/image/164a-400o400o2-RK53QgNQm7o2xatLDp6RRh.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/stuffbreaker",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/burton-smith-48132a34/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        499209
      ],
      "fullName": "Burton Smith",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "2ab36140-1f0d-46b1-85f5-c8f0222a4c4c",
      "firstName": "Cassandra",
      "lastName": "Faris",
      "bio": "Cassandra Faris is passionate about the human side of technology. She is the Community Manager for Kasten by Veeam, a Kubernetes data management platform. Her career has focused on supporting tech professionals through training, community outreach, open source, marketing, hiring, mentoring, and employee engagement. She is an international speaker who specializes in teaching people how to communicate, be more inclusive team members, advance their careers, and take care of their mental health.  She is President of the Stir Scholarship for women pursuing technology degrees and President Emeritus of the DogFoodCon tech conference. She has an MBA in Organizational Leadership. When she's not busy with the tech community, she is an avid tabletop gamer, corgi mom, and soccer fan who travels as much as possible.",
      "tagLine": "Community Manager, Kasten by Veeam",
      "profilePicture": "https://sessionize.com/image/d5e9-400o400o2-WLmiY4PukbtDxy3DBQhY77.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/cassandrafaris",
          "linkType": "Twitter"
        }
      ],
      "sessions": [
        498910
      ],
      "fullName": "Cassandra Faris",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "911aa52a-b0e0-42d7-99c2-e6701cfefcb0",
      "firstName": "Chris",
      "lastName": "Nelson",
      "bio": "Chris Nelson is the Co-Founder of Launch Scout, an agile software development firm in Cincinnati. He heads up the company’s apprenticeship program, mentors young developers and sets technology direction. What does he love most about his job? Sharing what he’s learned from over 20 years developing software across a wide range of industries. Chris has given workshops across the country and spent time teaching at Dev Bootcamp in Chicago. He’s spoken at conferences including Elixirconf, RailsConf, RubyConf, JavaOne, CodeMash and Scottish Ruby Conf.",
      "tagLine": "Co-Founder and Principal Engineer",
      "profilePicture": "https://sessionize.com/image/f258-400o400o2-2a-b0e0-42d7-99c2-e6701cfefcb0.a944d54a-eb9d-4300-b373-b5561ffacbd8.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/superchris",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/chris-nelson-038875/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://launchscout.com/blog",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://launchscout.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        499146
      ],
      "fullName": "Chris Nelson",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "424f7166-a882-473f-b05e-15aed7f9ff86",
      "firstName": "Cory",
      "lastName": "House",
      "bio": "Cory is a Pluralsight author, 9 time Microsoft MVP, and international speaker. He is founder of reactjsconsulting, where he helps companies transition to React. He has trained over 10,000 software developers at conferences and businesses worldwide. Cory has authored over a dozen courses on JavaScript, React, C#, automated testing, and web development on Pluralsight. He shares software development tips daily on Twitter as @housecor.",
      "tagLine": "Author / Consultant",
      "profilePicture": "https://sessionize.com/image/c210-400o400o2-05b6b3db-4cb4-42f9-8077-b2fa91ebc163.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "http://www.twitter.com/housecor",
          "linkType": "Twitter"
        }
      ],
      "sessions": [
        494891
      ],
      "fullName": "Cory House",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "70c37ef4-ef7f-48be-b2a6-790c716b6d29",
      "firstName": "Damian",
      "lastName": "Synadinos",
      "bio": "For more than 25 years, Damian Synadinos helped “build better software and build software better”. Now, through his company Ineffable Solutions (Ineffable-Solutions.com), he helps “build better people”. Damian is an international speaker and trainer, delivering keynotes, talks, and workshops that are fun and focused on fundamental topics and people-skills, based on real-world experience, and supplemented with deep research. His diverse experience spans many roles, companies, and industries, including airline, retail, insurance, finance, e-commerce, and commercial realty. Damian also helped organize the \"QA or the Highway\" testing conference (QAortheHighway.com) from 2014-2020, has over 10 years of theatrical improv experience, authored and illustrated a children’s book, “Hank and Stella in Something from Nothing” (HankAndStellaBooks.com), substitute teaches at primary schools, and draws strangers for fun (IDrawStrangers.com).",
      "tagLine": "building better software, and building software better",
      "profilePicture": "https://sessionize.com/image/45ec-400o400o2-f4-ef7f-48be-b2a6-790c716b6d29.09cdea8f-31d8-45d9-ae3e-6c3849b27d6f.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/dsynadinos",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/damiansynadinos/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.ineffable-solutions.com/blog",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.ineffable-solutions.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        486328
      ],
      "fullName": "Damian Synadinos",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8349af8b-173a-4670-a250-58284082fe4d",
      "firstName": "Daniel",
      "lastName": "Pries",
      "bio": "Daniel Pries is a polyglot engineer with an absolute love for the science of telling electrons how to behave across a metal substrate, so that it brings people together.  Whether its creating experiences for customers, solving unique technology problems, or coaching engineers to be the best versions of themselves to do the same.\r\n\r\nFor 8 hours a day, I have the unique privilege of guiding a few technology teams at M&T Bank.  I spend the other 16 hours on many amazing adventures and side quests with my wife and our five amazing children.",
      "tagLine": "Tech Manager of rock star engineers at M&T Bank",
      "profilePicture": "https://sessionize.com/image/6238-400o400o2-WP5gmnBdEUHXt8qQU6ViaZ.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/danielmpries/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        486349
      ],
      "fullName": "Daniel Pries",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "cd32c73d-00f3-434a-938a-9265bbe09e84",
      "firstName": "Debosmit",
      "lastName": "Ray",
      "bio": "Debo is a 3x startup founder and former staff engineer at Uber, where he oversaw critical security projects across infrastructure and product development. At every turn, Debo was confronted with two incompatible truths: 1) engineers lose a lot of precious time to inefficient tools and maintenance, and 2) organizations expect engineers to ship quickly. DevZero was created to reconcile this gap.",
      "tagLine": "Co-Founder, CEO - DevZero",
      "profilePicture": "https://sessionize.com/image/7ab5-400o400o2-MpvNgaraLdB9Wx7EGJDugD.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/DebosmitR",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/debo-ray/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://www.devzero.io/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        497991
      ],
      "fullName": "Debosmit Ray",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "053bf183-629a-4dd5-b66e-e2b1d7142a49",
      "firstName": "Dwayne",
      "lastName": "McDaniel",
      "bio": "Dwayne has been working as a Developer Relations professional since 2015 and has been involved in tech communities since 2005. He loves sharing his knowledge, and he has done so by giving talks at over a hundred events worldwide. Dwayne currently lives in Chicago. Outside of tech, he loves karaoke, live music, and performing improv.",
      "tagLine": "Developer Advocate at GitGuardian and huge fan of open source",
      "profilePicture": "https://sessionize.com/image/8dc7-400o400o2-TTqeKBmHU9MDounqx4gV61.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/McDwayne",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/dwaynemcdaniel/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://blog.gitguardian.com/author/dwayne/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://gitguardian.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        487520
      ],
      "fullName": "Dwayne McDaniel",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a9f6a949-c457-482d-b321-b0c6849fecec",
      "firstName": "Erissa",
      "lastName": "Duvall",
      "bio": "I gained my Accessibility knowledge after a little over 3 years in the IT Department at the American Printing House for the Blind here in Louisville, KY. While there, I was always looking to provide accessible technology training, help implement more Accessible technology options, and learn everything I could to help others. \r\n\r\nAfter graduating from Code Louisville in 2018, I decided to switch from tech support to something more development oriented. I currently work as an Accessibility Engineer with CVS.",
      "tagLine": "Accessibility Ally and Engineer",
      "profilePicture": "https://sessionize.com/image/6a8e-400o400o2-KGDwzfQ7z8yGzyqkWfjoNm.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/TheCorgiDev",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/corgidev/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://corgidev.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        487634
      ],
      "fullName": "Erissa Duvall",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "aae8e930-83f8-45be-b1a9-d47075235565",
      "firstName": "Glenn",
      "lastName": "Harmon Jr.",
      "bio": "I'm a Father, Husband, Cyclist, Software Engineer, and Champion of Tough Conversations.",
      "tagLine": "VP Engineering Decision Desk HQ",
      "profilePicture": "https://sessionize.com/image/e1ba-400o400o2-ffc4TRC4X7nUNbbsc3BPxp.jpeg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/GlennHarmonJr",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/glenn-harmon-jr-2b1a691a/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        496798
      ],
      "fullName": "Glenn Harmon Jr.",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "0623d5f0-582f-46cb-b963-e0d11bcd6161",
      "firstName": "Jared",
      "lastName": "Smith",
      "bio": "Jared Smith is a developer with 10 years experience working mostly with web applications and intelligent transportation systems (ITS) but has also dabbled in hardware emulation, Linux programming, and WebAssembly. These days he's slinging Typescript for the Web Platform team at Kroger. When not writing code or playing video games he's usually on a boat, at the beach, or hiking with his two daughters.",
      "tagLine": "Advanced Software Engineer for Web Platform at Kroger",
      "profilePicture": "https://sessionize.com/image/39b9-400o400o2-L3j5xTu7ke6WWHB6f7dM8K.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jared-smith-32a03067",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        495705
      ],
      "fullName": "Jared Smith",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "ea7dd1cc-19a7-49f4-87a9-333ad6cc0334",
      "firstName": "Jonathan",
      "lastName": "Mills",
      "bio": "Jonathan is a Pluralsight Author, Technology Advisor, and Business Leader. As the Director of Digital Technology at Yellow, Jon is responsible for all aspects of the development lifecycle for our customer-facing portfolio of products. \r\nAs a dedicated developer community leader, Jonathan serves on the board of directors for the Kansas City Developers Conference, Microsoft MVP, and is a regular speaker and keynote presenter at conferences around the globe.",
      "tagLine": "Technology Advisor",
      "profilePicture": "https://sessionize.com/image/ae2a-400o400o2-cc-19a7-49f4-87a9-333ad6cc0334.267bf1b8-fdf3-416b-b15f-b63a7dcdcd01.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/jonathanfmills",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jonathanfmills/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        498011
      ],
      "fullName": "Jonathan Mills",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f6dcea40-0fe0-4cd3-9be2-a2f20bd0201a",
      "firstName": "Jordan",
      "lastName": "Powell",
      "bio": "Jordan is a Google Developer Expert (GDE) and Developer Experience Engineer at Cypress. He is passionate about writing \"good code\" that is easy to read, test and maintain over time. He has over a decade of experience in software development, marketing, design, and video production.  Jordan also serves as the CEO & Co-Founder for the non-profit Dream On: Global. When he is not working, he spends his time as a husband, father and Cleveland sports fan.",
      "tagLine": "DX Engineer @ Cypress.io",
      "profilePicture": "https://sessionize.com/image/e1af-400o400o2-HCbpqvukY1TQ8j9ms3hjFw.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/jordanpowell88",
          "linkType": "Twitter"
        },
        {
          "title": "Blog",
          "url": "https://jordanpowell.online",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        493960
      ],
      "fullName": "Jordan Powell",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "468d2621-a815-4e39-8c07-6c18162c9b1a",
      "firstName": "Jordan",
      "lastName": "Thayer",
      "bio": "Jordan Thayer received their PhD in Artificial Intelligence in 2012 from the University of New Hampshire. Ever since, they've been applying artificial intelligence in academia and industry to problems including intrusion detection, planning, static analysis, and program generation.\r\n\r\nAs a thought leader at SEP, they’ve been proving that AI isn't futuristic technology. Rather, it's a collection of techniques of varying levels of maturity that can often reliably solve problems they have today. They give talks, runs workshop, visualize algorithm behavior, and build proofs of concept as well as products to show what AI can do already.",
      "tagLine": "AI Practice Lead for SEP",
      "profilePicture": "https://sessionize.com/image/3771-400o400o2-hZemfRHbjV6ghaTgqR8HDm.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/drbass",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jordan-seabass-thayer/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://sep.com/blog/author/jordan-thayer/",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        487894
      ],
      "fullName": "Jordan Thayer",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8cb1410d-99b1-456d-bcdc-3a5d8dc16c19",
      "firstName": "Karthik",
      "lastName": "Kotha",
      "bio": "Karthik leads the customer identity, e-commerce fraud, and privacy teams at Kroger. He is leading a multi-year project to migrate Kroger's customer apps from multiple custom identity implementations to a secure and standards based OAuth flow using Azure AD B2C and Microsoft Auth Library (MSAL). He establishes AuthN/AuthZ best practices across globally distributed dev teams in order to reduce fraud and to increase account security.",
      "tagLine": "Senior Engineering Manager at Kroger",
      "profilePicture": "https://sessionize.com/image/f997-400o400o2-KPw4ZrrpKDzabSSDYwxiAu.jpeg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kothakarthik/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        496784
      ],
      "fullName": "Karthik Kotha",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "17c299ee-d9fd-4020-b499-2837b2b3a2bf",
      "firstName": "Matt",
      "lastName": "Eland",
      "bio": "After several decades as a software engineer and engineering manager, Matt now serves as a software engineering instructor and gets to raise up future developers and unleash them upon the world to build awesome things.\r\n\r\nMatt is a Microsoft MVP in Artificial Intelligence and a Microsoft Certified Azure Data Scientist and AI Engineer associate. Matt runs several blogs and a YouTube channel on data science and software engineering topics, is currently pursuing a master's degree in data analytics, and helps organize the Central Ohio .NET Developer Group while contributing to local and regional conferences.\r\n\r\nIn his copious amounts of spare time, Matt continues to build nerdy things and looks for ways to share them with the larger community.",
      "tagLine": "Microsoft MVP in AI",
      "profilePicture": "https://sessionize.com/image/73a0-400o400o2-MX2vxaEVrGpQGHyA3VRMRr.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/IntegerMan",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/matteland/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://AccessibleAI.dev",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://TechElevator.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        489156
      ],
      "fullName": "Matt Eland",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "51971bf5-3126-4aae-9825-76a0064c8c78",
      "firstName": "Matthew",
      "lastName": "Groves",
      "bio": "Matthew D. Groves is a guy who loves to code.  It doesn't matter if it's C#, jQuery, or PHP: he'll submit pull requests for anything.  He has been coding professionally ever since he wrote a QuickBASIC point-of-sale app for his parent's pizza shop back in the 90s.  He currently works for Couchbase, helping developers in any way he can. His free time is spent with his family, watching the Reds, and getting involved in the developer community.  He is the author of AOP in .NET, Pro Microservices in .NET, a Pluralsight author, and a Microsoft MVP.",
      "tagLine": "Microsoft MVP, DevRel, coder",
      "profilePicture": "https://sessionize.com/image/5791-400o400o2-sfyLMcPniyKqkoxZ7quC7y.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/mgroves",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/mgroves",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://crosscuttingconcerns.com",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://couchbase.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        497962
      ],
      "fullName": "Matthew Groves",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "52999ef9-57f0-4e59-a4fb-cf8f7f865216",
      "firstName": "Orville",
      "lastName": "Bennett",
      "bio": "I am a recovering chemist/virologist/microbiologist/physiologist with a penchant for research. Once I got married I decided the starving scientist gig, while awesome, wasn't really conducive to raising the considerably sized family I'd like to have (one wife, 6 kids, 1 goat and 26 chickens).\r\n\r\nAnd so it was that through prayer, persistence and a lot of reading I pivoted into the role of a Web Developer. Then one day a manager asked me to write C++ and somehow I became a Software Engineer+DevOps Engineer+Software Development Engineer in Test chimera. \r\n\r\nNow I'm back in Front-End land using all that accumulated knowledge.",
      "tagLine": "Christian. Dad. Farmer. Owner of ORB IT Solutions.",
      "profilePicture": "https://sessionize.com/image/a02f-400o400o2-JzLZTrVq2d4v73Ujic95NG.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/orville-bennett/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://orbitsolutions.dev/blog/",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        497235
      ],
      "fullName": "Orville Bennett",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "6a15c59e-f611-47d6-9523-ca6999f281f0",
      "firstName": "Quinn",
      "lastName": "Hou",
      "bio": "Quinn is a software engineer at Dapper Labs, where she has experimented and launched multiple projects. She remembers the first day whiteboarding the system design of NBA Topshot and enjoys bantering and building software with the team. Currently, Quinn is focused on developing an interfacing platform that simplifies dApps' access to the blockchain, reducing the complexity of web3.",
      "tagLine": "Software Engineer, Dapper Labs",
      "profilePicture": "https://sessionize.com/image/8bbe-400o400o2-V4Bh5Hjh73auNuxwpiBGC9.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/quinnhou/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://www.dapperlabs.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        497570
      ],
      "fullName": "Quinn Hou",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "21cf0bf8-44ec-4b3d-b3e0-005a7a59420b",
      "firstName": "Rey",
      "lastName": "Riel",
      "bio": "Rey serves as Developer Advocate for 8base. Since 2016 Rey has been advocating for developers, doing what he can to make developers lives easier and more fun, driving awareness and creating code to make developers successful. Being well-versed in a plethora of languages over the last decade has given Rey a vast look at the developer community as a whole. Committed to helping developers of all sorts Rey is also a co-organizer for the Ottawa Javascript Meetup group, a co-organizer for Random Hacks of Kindness and an organizer for developer focused conferences, including ForwardJS Ottawa.",
      "tagLine": "Developer Advocate @ 8base, helping developers best I can",
      "profilePicture": "https://sessionize.com/image/bf18-400o400o2-n4Xn7UBmAfBBo2WutwBQZJ.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/rjriel87",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/rey-riel-31156126/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://8base.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        493694
      ],
      "fullName": "Rey Riel",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "5706e39d-8684-41d1-8841-cf2f6c07e20f",
      "firstName": "Ricky",
      "lastName": "Tucker",
      "bio": "Ricky Tucker is UX/UI designer for Louisiana's Office of Technology Services. In addition to contributing the state's Design System, Pelican, he works daily with state agencies to develop digital products with the goal of improving the lives of Louisiana residents. Ricky holds multiple Interactive Design Foundation certificates, was well as the W3Cx Introduction to Web Accessibility certificate. ",
      "tagLine": "UX/UI Designer - Louisiana Office of Technology Services",
      "profilePicture": "https://sessionize.com/image/be6b-400o400o2-SAGDkNFbZRk5qsksyWMLKB.JPG",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/TuckTales",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/rltucker/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        489354
      ],
      "fullName": "Ricky Tucker",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "3963f1e7-00c7-47ba-9c88-9f1d9be28b43",
      "firstName": "Robert",
      "lastName": "Herbig",
      "bio": "Robert Herbig is passionate about leading teams to deliver products users love.\r\n\r\nHe is a Lead Software Engineer at SEP, a software product design and development company. In his 15+ years in the software industry, he has worked on products ranging in size from small apps to enterprise systems; embedded, desktop, web, and cloud platforms; and in a variety of markets and domains including aerospace, medical, agriculture, construction, and secure communication.\r\n\r\nAs an AI Practice Lead at SEP, he strives to educate clients and peers about what AI can do, identify complex problems AI can address in whole or in part, and incorporate AI into software products that make a difference for their users.\r\n\r\nHe currently lives in Carmel, Indiana with his wonderful wife, three rambunctious sons, and three dogs.",
      "tagLine": "AI Practice Lead at SEP",
      "profilePicture": "https://sessionize.com/image/4327-400o400o2-nntDrhduMjHZ856ok5W8wD.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/RobertHerbig",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/RobertHerbig",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.RobertHerbig.com/",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        487890
      ],
      "fullName": "Robert Herbig",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "49b5ee60-1520-4c76-8840-632ac701d380",
      "firstName": "Ruchi",
      "lastName": "Agarwal",
      "bio": "I am a senior software engineer at Netflix with over 12 years of experience in building full stack applications. I have led many projects at Netflix and hv been a key player in the major success of these applications. ",
      "tagLine": "Netflix, Senior Software Engineer",
      "profilePicture": "https://sessionize.com/image/408e-400o400o2-JzrDZMpXqnic986PHXsnp7.jpeg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://www.twitter.com/ruchiii75",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/ruchi-agarwal-2582562a",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.linkedin.com/in/ruchi-agarwal-2582562a",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://netflix.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        497256
      ],
      "fullName": "Ruchi Agarwal",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "0785f402-af78-4d26-a024-a1fb32fefe04",
      "firstName": "Ryan",
      "lastName": "Booz",
      "bio": "Ryan is an Advocate at Redgate focusing on PostgreSQL. Ryan has been working as a PostgreSQL advocate, developer, DBA and product manager for more than 20 years, primarily working with time-series data on PostgreSQL and the Microsoft Data Platform.\r\n\r\nRyan is a long-time DBA, starting with MySQL and Postgres in the late 90s. He spent more than 15 years working with SQL Server before returning to PostgreSQL full-time in 2018. He’s at the top of his game when he's learning something new about the data platform or teaching others about the technology he loves.",
      "tagLine": "Developer Advocate at Redgate",
      "profilePicture": "https://sessionize.com/image/3fc9-400o400o2-WGQV8kefRGxfbxDXkBVGyN.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://www.twitter.com/ryanbooz",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/ryanbooz/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.softwareandbooz.com",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.red-gate.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        499228
      ],
      "fullName": "Ryan Booz",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "9bde9de9-7bcb-4077-8087-47bf492a1344",
      "firstName": "Sarah",
      "lastName": "Dutkiewicz",
      "bio": "Sarah Dutkiewicz is a native Clevelander, Microsoft MVP in Developer Technologies, published technical author of a PowerShell book, podcast/live coding guest, conference organizer, hackathon lead organizer, speaker, community advocate, software developer, wife, and mom.  She speaks on topics such as Azure DevOps for varied audiences, database development, web development, and user experience guidance for developers.  With her varied career, Sarah brings developer, DBA, and server admin perspectives to technical and non-technical teams, bridging communication gaps, and helping them grow.",
      "tagLine": "Wife, mom, techie - 100% me, unapologetically",
      "profilePicture": "https://sessionize.com/image/c39a-400o400o2-GUCJ1VULwVKHJyqM83BFBW.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/sadukie",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/sadukie",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://sadukie.com",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        486724
      ],
      "fullName": "Sarah Dutkiewicz",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "6d5add80-9200-4afc-9f33-3cd18e26d723",
      "firstName": "Seth",
      "lastName": "Eliot",
      "bio": "As a Principal Developer Advocate with AWS, Seth guides builders on how to architect and build resilient, scalable systems in the cloud. He draws on over 12 years of experience in multiple engineering roles across Amazon. Previously he was Reliability Lead for AWS Well-Architected. Before that, as Principal Solutions Architect he worked hands-on with engineers to optimize how they use AWS for the services that power Amazon.com. Prior to that, he was Principal Engineer for Amazon Fresh and International Technologies. Seth joined Amazon in 2005 where soon after, he helped develop the technology that would become Prime Video. You can follow Seth on twitter @setheliot, or on LinkedIn at https://www.linkedin.com/in/setheliot/.",
      "tagLine": "Principal Developer Advocate, AWS",
      "profilePicture": "https://sessionize.com/image/7a53-400o400o2-7RTiaZu1Z2jFse6rj2YaeH.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/setheliot",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/setheliot/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://linktr.ee/setheliot",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        489725
      ],
      "fullName": "Seth Eliot",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b7235790-4c4a-491c-a8a1-1ed82a5d70b3",
      "firstName": "Seth",
      "lastName": "Petry-Johnson",
      "bio": "Seth spent 21 years as a professional developer/architect before finally joining the dark side of management. He now spends his days as a pointy-haired boss leading a small-but-mighty product development team in the search for elegant solutions to complex problems. He is passionate about clean architecture, testable systems, and bringing order to chaos. Seth lives in Columbus, OH and is an active participant in the Midwest developer community. He'll write TPS reports when he has to, but still enjoys writing, reviewing, and talking about code.",
      "tagLine": "Pointy-haired boss by day, coder by night",
      "profilePicture": "https://sessionize.com/image/1d0c-400o400o2-apT1veHMEsTzkNtDX4hGKo.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/spetryjohnson",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/sethpetryjohnson/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        488388
      ],
      "fullName": "Seth Petry-Johnson",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "d6efef12-0cc5-4fe1-b506-20bee22d0fff",
      "firstName": "Sho",
      "lastName": "Fola",
      "bio": "Synthesizing information and making connections is at the heart of most of what I do. I love connecting the dots across so many domains.\r\n\r\nFrom building apps that focus on connecting people and their data to writing articles or speaking at conferences, I use any medium at my disposal to achieve this aim.\r\n\r\nYou can catch me in my free time using SciKit Learn and PyTorch to tackle NLP challenges. The only thing that tops that is spending time being a husband and father of three amazing kids",
      "tagLine": "Life Learner, Technologist, Speaker & Machine Learning Practitioner",
      "profilePicture": "https://sessionize.com/image/81ce-400o400o2-12-0cc5-4fe1-b506-20bee22d0fff.2d625839-cc31-4773-96f6-96f178bfd33d.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/ShoReason",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/shofola",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://www.shoreason.com",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        497485
      ],
      "fullName": "Sho Fola",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "10fe89d2-3c89-4c02-b4da-cf84fda082b8",
      "firstName": "Stephen",
      "lastName": "Shary",
      "bio": "I am a full-stack developer and technical lead that uses Python, JVM languages and Javacript.  I enjoy functional programming, delivering production code as fast as possible and robust automated testing. I work with teams to overhaul their projects, improve code quality, speed delivery to production and improve culture.\r\n\r\nI am also working in machine learning and AI to improve areas ability to provide accurate data and supplement gaps with predictions.  I focus on neural networks with Keras and Tensorflow.  I am learning how to productionalize data science to become a platform for companies and departments",
      "tagLine": "Lead Engineer at ACV Auctions",
      "profilePicture": "https://sessionize.com/image/bd6d-400o400o2-SVW3F8SLayxekUfGui3L4M.jpeg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/StephenShary",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/stephenshary/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        499014
      ],
      "fullName": "Stephen Shary",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "3973e7f0-7d80-44cb-8831-b996f73f75f2",
      "firstName": "Tori",
      "lastName": "Brenneison",
      "bio": "Tori Brenneison is a programming instructor, software dev, and former art historian whose purpose in life is to serve as a warning to others. When not teaching full-stack development to the rockstar career changers at Tech Elevator and doing her absolute best to promote diversity in the technology field, she can usually be found hiking, petting strange dogs, or admiring her collection of midcentury bakeware. Best to approach her in the wild with a sacrificial cup of coffee, and be forewarned: she's a hugger.",
      "tagLine": "Code Mom, Cat Lady, Educator & Software Developer",
      "profilePicture": "https://sessionize.com/image/75a4-400o400o2-GqbwYws9d2eRn72hhA56Zr.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "http://www.twitter.com/not_unambitious",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/toribrenneison/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.codemom.com",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.techelevator.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        492693
      ],
      "fullName": "Tori Brenneison",
      "categoryItems": [],
      "questionAnswers": []
    }
  ],
  "questions": [],
  "categories": [
    {
      "id": 49208,
      "title": "Level",
      "items": [
        {
          "id": 167586,
          "name": "Introductory and overview",
          "sort": 1
        },
        {
          "id": 167587,
          "name": "Intermediate",
          "sort": 2
        },
        {
          "id": 167588,
          "name": "Advanced",
          "sort": 3
        }
      ],
      "sort": 0,
      "type": "session"
    },
    {
      "id": 49212,
      "title": "Tags",
      "items": [
        {
          "id": 167601,
          "name": "AI & ML",
          "sort": 1
        },
        {
          "id": 167592,
          "name": "Back-End",
          "sort": 2
        },
        {
          "id": 167595,
          "name": "Cloud & Infrastructure",
          "sort": 3
        },
        {
          "id": 167603,
          "name": "Data",
          "sort": 4
        },
        {
          "id": 167594,
          "name": "Databases",
          "sort": 5
        },
        {
          "id": 167597,
          "name": "Design",
          "sort": 6
        },
        {
          "id": 167604,
          "name": "DevOps",
          "sort": 7
        },
        {
          "id": 167593,
          "name": "Front-End &  Web",
          "sort": 8
        },
        {
          "id": 167600,
          "name": "Hardware & IoT",
          "sort": 9
        },
        {
          "id": 181275,
          "name": "Languages & Frameworks",
          "sort": 10
        },
        {
          "id": 167591,
          "name": "Mobile",
          "sort": 11
        },
        {
          "id": 167599,
          "name": "Patterns & Practices",
          "sort": 12
        },
        {
          "id": 167596,
          "name": "Professional Skills",
          "sort": 13
        },
        {
          "id": 167602,
          "name": "Security",
          "sort": 14
        },
        {
          "id": 167598,
          "name": "Testing",
          "sort": 15
        },
        {
          "id": 167605,
          "name": "Other",
          "sort": 16
        }
      ],
      "sort": 1,
      "type": "session"
    }
  ],
  "rooms": [
    {
      "id": 35721,
      "name": "River A",
      "sort": -1
    },
    {
      "id": 35722,
      "name": "River B",
      "sort": 0
    },
    {
      "id": 35723,
      "name": "Pavillion C",
      "sort": 2
    },
    {
      "id": 38471,
      "name": "Pavillion D",
      "sort": 2
    },
    {
      "id": 38472,
      "name": "Pavillion E",
      "sort": 4
    },
    {
      "id": 38473,
      "name": "Main Ballroom",
      "sort": 5
    }
  ]
}